"use strict";

// 楽譜をscore/.scoreから作成する
// 不正値の検証はしていない

// 出力される (getRandomScore() の戻り値) の例
//
// const score = {
// 	title: 'きらきら星',
// 	data: [
// 		{ note: 'ド', duration: 500 },
// 		{ note: '', duration: 500 }, // 休符
// 		{ note: 'ソ', duration: 2000 }
// 	]
// };

class Score {
	// 解析済み楽譜データ
	static #parsedScores = [];

	// クラスロード時、楽譜文字列を解析済み楽譜データに変換
	static {
		const rawScores = [{
			title: "チューリップの歌",
			data:
				`ド(0.5秒)レ(0.5秒)ミ(1秒)ド(0.5秒)レ(0.5秒)ミ(1秒)
ソ(0.5秒)ミ(0.5秒)レ(0.5秒)ド(0.5秒)レ(0.5秒)ミ(0.5秒)レ(1秒)
ド(0.5秒)レ(0.5秒)ミ(1秒)ド(0.5秒)レ(0.5秒)ミ(1秒)ソ(0.5秒)ミ(0.5秒)レ(0.5秒)ド(0.5秒)レ(0.5秒)ミ(0.5秒)ド(1秒)
ソ(0.25秒)休符(0.25秒)ソ(0.25秒)休符(0.25秒)ミ(0.25秒)休符(0.25秒)ソ(0.25秒)休符(0.25秒)
ラ(0.25秒)休符(0.25秒)ラ(0.25秒)休符(0.25秒)ソ(1秒)
ミ(0.25秒)休符(0.25秒)ミ(0.25秒)休符(0.25秒)レ(0.25秒)休符(0.25秒)レ(0.25秒)休符(0.25秒)ド(4秒)`,
		},
		{
			title: "チューリップの歌",
			data:
				`ド(0.5秒)休符(0.5秒)ド(0.5秒)休符(0.5秒)ソ(0.5秒)休符(0.5秒)ソ(0.5秒)休符(0.5秒)
ラ(0.5秒)休符(0.5秒)ラ(0.5秒)休符(0.5秒)ソ(2秒)
ファ(0.5秒)休符(0.5秒)ファ(0.5秒)休符(0.5秒)ミ(0.5秒)休符(0.5秒)ミ(0.5秒)休符(0.5秒)
レ(0.5秒)休符(0.5秒)レ(0.5秒)休符(0.5秒)ド(2秒)

ソ(0.5秒)休符(0.5秒)ソ(0.5秒)休符(0.5秒)ファ(0.5秒)休符(0.5秒)ファ(0.5秒)休符(0.5秒)
ミ(0.5秒)休符(0.5秒)ミ(0.5秒)休符(0.5秒)レ(2秒)
ソ(0.5秒)休符(0.5秒)ソ(0.5秒)休符(0.5秒)ファ(0.5秒)休符(0.5秒)ファ(0.5秒)休符(0.5秒)
ミ(0.5秒)休符(0.5秒)ミ(0.5秒)休符(0.5秒)レ(2秒)

ド(0.5秒)休符(0.5秒)ド(0.5秒)休符(0.5秒)ソ(0.5秒)休符(0.5秒)ソ(0.5秒)休符(0.5秒)
ラ(0.5秒)休符(0.5秒)ラ(0.5秒)休符(0.5秒)ソ(2秒)
ファ(0.5秒)休符(0.5秒)ファ(0.5秒)休符(0.5秒)ミ(0.5秒)休符(0.5秒)ミ(0.5秒)休符(0.5秒)
レ(0.5秒)休符(0.5秒)レ(0.5秒)休符(0.5秒)ド(4秒)`
		}
		];

		this.#parsedScores = rawScores.map(item => ({ title: item.title, data: this.#makeScore(item.data) }));
	}

	// 文字列から楽譜を作成
	static #makeScore(scoreStr) {
		return scoreStr.split(')')
			.filter(item => item.trim() !== '')/* 要素から改行スペースを取り除いた後、空文字のみの要素だった場合消す */
			.map(item => {
				const [noteRaw, timeStr] = item.split('(');
				const duration = parseFloat(timeStr.replace('秒', '')) * 1000;
				let note = noteRaw.trim();
				if (note === "休符") note = "";

				return { note: note, duration: duration };
			});
	}

	// parsedScoresに入っている楽譜の中から、ランダムに一つ楽譜を出力する
	static getRandomScore() {
		const randomIndex = Math.floor(Math.random() * this.#parsedScores.length);
		const target = this.#parsedScores[randomIndex];
		return target;
	}
}
